{
  "ID": "_0kknjKJ6BH",
  "Title": "End-to-end reconstruction meets data-driven regularization for inverse problems",
  "URL": "https://openreview.net/forum?id=_0kknjKJ6BH",
  "paper_draft_url": "/references/pdf?id=Yy2CqW3WPY7",
  "Conferece": "NeurIPS_2021",
  "input": {
    "source": "CRF",
    "title": "End-to-end reconstruction meets data-driven regularization for inverse problems",
    "authors": [],
    "emails": [],
    "sections": [
      {
        "heading": null,
        "text": "We propose an unsupervised approach for learning end-to-end reconstruction oper-1 ators for ill-posed inverse problems. The proposed method combines the classical2 variational framework with iterative unrolling, which essentially seeks to mini-3 mize a weighted combination of the expected distortion in the measurement space4 and the Wasserstein-1 distance between the distributions of the reconstruction5 and ground-truth. More specifically, the regularizer in the variational setting is6 parametrized by a deep neural network and learned simultaneously with the un-7 rolled reconstruction operator. The variational problem is then initialized with8 the reconstruction of the unrolled operator and solved iteratively till convergence.9 Notably, it takes significantly fewer iterations to converge, thanks to the excellent10 initialization obtained via the unrolled operator. The resulting approach combines11 the computational efficiency of end-to-end unrolled reconstruction with the well-12 posedness and noise-stability guarantees of the variational setting. Moreover, we13 demonstrate with the example of X-ray computed tomography (CT) that our ap-14 proach outperforms state-of-the-art unsupervised methods, and that it outperforms15 or is on par with state-of-the-art supervised learned reconstruction approaches.16\n1 Introduction17\nInverse problems are ubiquitous in imaging applications, wherein one seeks to recover an unknown18 model parameter x ∈ X from its incomplete and noisy measurement, given by19\nyδ = A(x) + e ∈ Y. Here, the forward operator A : X→ Y models the measurement process in the absence of noise, and20 e, with ‖e‖2 ≤ δ, denotes the measurement noise. For example, in computed tomography (CT), the21 forward operator computes line integrals of x over a predetermined set of lines in R3 and the goal22 is to reconstruct x from its projections along these lines. Without any further information about x,23 inverse problems are typically ill-posed, meaning that there could be several reconstructions that are24 consistent with the measurement, even without any noise.25\nThe variational framework circumvents ill-posedness by encoding prior knowledge about x via a26 regularization functionalR : X→ R. In the variational setting, one solves27\nmin x∈X LY(yδ,A(x)) + λR(x), (1)\nwhere LY : Y× Y→ R+ measures data-fidelity andR penalizes undesirable or unlikely solutions.28 The penalty λ > 0 balances the regularization strength with the fidelity of the reconstruction. The29 variational problem (1) is said to be well-posed if it has a unique solution varying continuously in yδ .30\nThe success of deep learning in recent years has led to a surge of data-driven approaches for31 solving inverse problems [5], especially in imaging applications. These methods come broadly32\nSubmitted to 35th Conference on Neural Information Processing Systems (NeurIPS 2021). Do not distribute.\nin two flavors: (i) end-to-end trained models that aim to directly map the measurement to the33 corresponding parameter and (ii) learned regularization methods that seek to find a data-adaptive34 regularizer instead of handcrafting it. Techniques in both categories have their relative advantages35 and demerits. Specifically, end-to-end approaches offer fast reconstruction of astounding quality, but36 lack in terms of theoretical guarantees and need supervised data (i.e., pairs of input and target images)37 for training. On the contrary, learned regularization methods inherit the provable well-posedness38 properties of the variational setting and can be trained in an unsupervised manner, however the39 reconstruction entails solving a high-dimensional optimization problem, which is often slow and40 computationally demanding.41\nOur work derives ideas from learned optimization and adversarial machine learning, and makes an42 attempt to combine the best features of both aforementioned paradigms. In particular, the proposed43 method offers the flexibility of unsupervised training, produces fast reconstructions comparable to44 end-to-end supervised methods in quality, while enjoying the well-posedness and stability guarantees45 of the learned regularization framework. We first provide a brief overview of the literature on46 data-driven techniques for inverse problems before explaining our specific contributions in detail.47\n1.1 Related works48\nEnd-to-end fully learned methods for imaging inverse problems either map the measurement directly49 to the image [30, 19], or learn to eliminate the artifacts from a model-based technique [10]. Such50 approaches are data-intensive and may generalize poorly when trained on limited data. Iterative51 unrolling [17, 29, 2, 11, 16], with its origin in the seminal work by Gregor and LeCun on data-52 driven sparse coding [9], employs reconstruction networks that are inspired by optimization-based53 approaches and hence are interpretable. The unrolling paradigm enables one to encode the knowledge54 about the acquisition physics into the model architecture [3], thereby achieving data-efficiency.55 Nevertheless, end-to-end trained methods are supervised, and it is often challenging to obtain a large56 ensemble of paired data, especially in medical imaging applications.57\nLearned regularization methods, broadly speaking, aim to learn a data-driven regularizer in the58 variational setting. Some notable approaches in this paradigm include adversarial regularization (AR)59 [14] and its convex counterpart [18], network Tikhonov (NETT) [13], total deep variation (TDV)60 [12], etc., wherein one explicitly parametrizes the regularization functional using a neural network.61 The regularization by denoising (RED) approach aims to solve inverse problems by using a denoiser62 inside an algorithm for minimizing the variational objective [21, 22, 7]. The Plug-and-play (PnP)63 method [25] with a learned denoiser is also implicitly equivalent to data-driven regularization, subject64 to additional constraints on the denoiser [20]. The deep image prior technique [26] does not require65 training, but it seeks to regularize the solution by restricting it to be in the range of a deep generator66 and can thus be interpreted broadly as a deep learning-based regularization scheme. It is relatively67 easier to analyze learned regularization schemes using the machinery of classical functional analysis68 [24], but they fall short in terms of reconstruction quality. Moreover, these methods require one to69 solve a high-dimensional, potentially non-convex, variational problem, leading to slow reconstruction70 and lack of provable convergence.71\n1.2 Specific contributions72\nOur work seeks to combine iterative unrolling with data-adaptive regularization via an adversarial73 learning framework, and hence is referred to as unrolled adversarial regularization (UAR). The74 proposed approach learns a data-adaptive regularizer parametrized by a neural network, together with75 an iteratively unrolled reconstruction network that minimizes the corresponding expected variational76 loss in an adversarial setting. Unlike AR [14] where the undesirable images are taken as the pseudo-77 inverse reconstruction and kept fixed throughout the training, we update them with the output of78 the unrolled reconstruction network in each training step, and, in turn, use them to further improve79 the regularizer. Thanks to the Kantorovich-Rubinstein (KR) duality [4], the alternating learning80 strategy of the reconstruction and the regularizer networks is equivalent to minimizing the expected81 data-fidelity over the distribution of the measurements, penalized by the Wasserstein-1 distance82 between the distribution of the reconstruction and the ground-truth. Once trained, the reconstruction83 operator produces a fast, end-to-end reconstruction. We show that this efficient reconstruction can be84 improved further by a refinement step that involves running a few iterations of gradient-descent on the85 variational loss with the corresponding regularizer, starting from this initial estimate. The refinement86\nstep not only produces reconstructions that outperform state-of-the-art unsupervised methods and are87 competitive with supervised methods, but also facilitates a well-posedness and stability analyses akin88 to classical variational approaches [24]. Our theoretical results on the learned unrolled operator and89 the regularizer are corroborated by strong experimental evidence for the CT inverse problem.90\n2 The proposed unrolled adversarial regularization (UAR) approach91\nIn this section, we give a short mathematical background on optimal transport, followed by a detailed92 description of the UAR framework, including the training protocol and the network architectures.93\n2.1 Background on Optimal transport94\nOptimal transport theory [8, 27] has recently gained prominence in the context of measuring the95 distance between two probability distributions. In particular, given two probability distributions π196 and π2 on Rn, the Wasserstein-1 distance between them is defined as97\nW1(π1, π2) := inf µ∈Π(π1,π2)\n∫ ‖x1 − x2‖2 dµ(x1,x2), (2)\nwhere Π(π1, π2) denotes all transport plans having π1 and π2 as marginals. The Wasserstein distance98 has proven to be suitable for deep learning tasks, when the data is assumed to be concentrated on99 low-dimensional manifolds in Rn. It has been shown that in such cases, the Wasserstein distance100 provides a usable gradient during training [4], as opposed to other popular divergence measures.101\nBy the KR duality, the Wasserstein-1 distance can be computed equivalently by solving a maximiza-102 tion problem over the space of 1-Lipschitz functions (denoted by L1) as103\nW1(π1, π2) = sup R∈L1\n∫ R(x1) dπ1(x1)− ∫ R(x2) dπ2(x2), (3)\nprovided that π1 and π2 have compact support [23]. Finally, we recall the definition of push-forward104 of probability measures, which is used extensively in our theoretical exposition. Given a probability105 measure π on A and a measurable map T : A → B, we define the push-forward of π by T (denoted106 as T#π) as a probability measure on B such that T#π(B) = π(T−1(B)), for all measurableB ⊂ B.107\n2.2 Training strategy and model parametrization for UAR108\nThe principal idea behind UAR is to learn an unrolled deep network Gφ : Y→ X for reconstruction,109 together with a regularization functionalRθ : X→ R parametrized by another convolutional neural110 network (CNN). The role of Rθ is to discern ground-truth images from images produced by Gφ,111 while Gφ learns to minimize the variational loss withRθ as the regularizer. As the images produced112 by Gφ gets better,Rθ faces a progressively harder task of telling them apart from the ground-truth113 images, thus leading to an improved regularizer. On the other hand, as the regularizer improves, the114 quality of reconstructions obtained using Gφ improves simultaneously. Consequently, Gφ and Rθ115 helps each other improve as the training progresses via an alternating update scheme.116\n2.2.1 Adversarial training117\nLet us denote by πx the ground-truth distribution and by πyδ the distribution of the noisy measurement.118 The UAR algorithm trains Gφ andRθ simultaneously starting from an appropriate initialization. At119 the kth iteration of training, the parameters φ of the reconstruction network are updated as120\nφk ∈ arg min φ J (1) k (φ), where J (1) k (φ) := Eπyδ [∥∥A(Gφ(yδ))− yδ∥∥22 + λRθk(Gφ(yδ))] , (4) for a fixed regularizer parameter θk. Subsequently, the regularizer parameters are updated as121\nθk+1 ∈ arg max θ:Rθ∈L1 J (2) k (θ), where J (2) k (θ) := Eπyδ\n[ Rθ ( Gφk(yδ) )] − Eπx [Rθ (x)] . (5)\nThe learning protocol for UAR is unsupervised, since the loss functionals J (1)k (φ) and J (2) k (θ) can be122 computed based solely on the marginals πx and πyδ . The alternating update algorithm in (4) and (5)123\nAlgorithm 1 Learning unrolled adversarial regularization (UAR). 1. Input: Data-set {xi}Ni=1 ∼ πx and { yj }N j=1 ∼ πyδ , initial reconstruction network parameter\nφ and regularizer parameter θ, batch-size nb = 1, penalty λ = 0.1, gradient penalty λgp = 10.0, Adam optimizer parameters (β1, β2) = (0.50, 0.99). 2. (Learn a baseline regularizer) for mini-batch k = 1, 2, · · · , 10 Nnb , do: • Sample xj ∼ πx, yj ∼ πyδ , and j ∼ uniform [0, 1]; for 1 ≤ j ≤ nb. Compute uj = A†(yj)\nand x( )j = jxj + (1− j)uj . • θ ← Adamη,β1,β2(θ,∇ J̃1(θ)), where η = 10−4, and\nJ̃1(θ) = 1\nnb nb∑ j=1 [ Rθ (xj)−Rθ (uj) + λgp (∥∥∥∇Rθ (x( )j )∥∥∥ 2 − 1 )2] .\n3. (Learn a baseline reconstruction operator) for mini-batch k = 1, 2, · · · , 5 Nnb , do: • Sample yj ∼ πyδ , and compute J̃2(φ) = 1nb ∑nb j=1 ∥∥yj −A (Gφ(yj))∥∥22 + λRθ (Gφ(yj)). • φ← Adamη,β1,β2(φ,∇ J̃2(φ)), with η = 10−4. 4. (Jointly trainRθ and Gφ adversarially) for mini-batch k = 1, 2, · · · , 25 Nnb , do: • Sample xj , yj , and j ∼ uniform [0, 1]; for 1 ≤ j ≤ nb. Compute uj = Gφ(yj) and x\n( ) j = jxj + (1− j)uj .\n• θ ← Adamη,β1,β2(θ,∇ J̃1(θ)), where J̃1(θ) is as in Step 2, with η = 2× 10−5. • Update φ← Adamη,β1,β2(φ,∇ J̃2(φ)) twice, with J̃2(φ) as in Step 3, and η = 2× 10−5.\n5. Output: The trained networks Gφ andRθ.\nessentially seeks to solve the min-max variational problem given by124\nmin φ max θ:Rθ∈L1 Eπ yδ ∥∥A(Gφ(yδ))− yδ∥∥22 + λ(Eπyδ [Rθ (Gφ(yδ))]− Eπx [Rθ (x)]) . (6) Thanks to KR duality in (3) and the definition of push-forward, (6) can be reformulated as125\nmin φ Eπ yδ ∥∥A(Gφ(yδ))− yδ∥∥22 + λW1 ((Gφ)#πyδ , πx) . (7) We refer the reader to Section 3 for a mathematically rigorous statement of this equivalence as well126 as for a well-posedness theory of the problem in (7). Note that the equivalence of the alternating127 minimization procedure and the variational problem in (7) holds only if the regularizer is fully128 optimized in every iteration. Nevertheless, in practice, the reconstruction and regularizer networks129 are not fully optimized in every iteration. Instead, one refines the parameters by performing one (or a130 few) Adam updates on the corresponding loss functionals. Notably, if W1 ( (Gφk)#πyδ , πx ) = 0, i.e.,131 the parameters of G are such that the reconstructed images match the ground-truth in distribution,132 the loss functional J (2)k (θ) and its gradient vanish, leading to no further update of θ. Thus, both133 networks stop updating when the outputs of Gφ are indistinguishable from the ground-truth images.134 The concrete training steps are listed in Algorithm 1.135\n2.2.2 Iteratively unrolled reconstruction operator136\nThe objective of Gφ is to approximate the minimizer of the variational loss withRθ as the regularizer.137 Therefore, an iterative unrolling strategy akin to [3] is adopted for parameterizing Gφ. Iterative138 unrolling seeks to mimic the variational minimizer via a primal-dual-style algorithm [6], with the139 proximal operators in the image and measurement spaces replaced with trainable CNNs. Although140 the variational loss in our case is non-convex, this parametrization for Gφ is chosen because of its141 expressive power over a generic network. Initialized with x(0) = A† yδ and h(0) = 0, Gφ produces142 a reconstruction x(L) by iteratively applying the CNNs Λ\nφ (`) p and Λ φ (`) d in X and Y, respectively:143\nh(`+1) = Γ φ (`) d\n( h(`), σ(`)A(x`),yδ ) , andx(`+1) = Λ\nφ (`) p\n( x(`), τ (`)A∗(h`+1) ) , 0 ≤ ` ≤ L−1.\nThe step-size parameters σ(`) and τ (`) are also made learnable and initialized as σ(`) = τ (`) = 0.01144 for each layer `. The number of layers L is typically much smaller (we take L = 20) than the number145 of iterations needed by an iterative primal-dual scheme to converge, thus expediting the reconstruction146 by two orders of magnitude once trained.147\nThe regularizerRθ is taken as a deep CNN with six convolutional layers, followed by one average-148 pooling and two dense layers in the end.149\n2.2.3 Variational regularization as a refinement step150\nThe unrolled operator Gφ∗ trained by solving the min-max problem in (6) provides reasonably good151 reconstruction when evaluated on X-ray CT, and already outperforms state-of-the-art unsupervised152 methods (c.f. Section 4). We demonstrate that the regularizer Rθ∗ obtained together with Gφ∗ by153 solving (6) can be used in the variational framework to further improve the quality of the end-to-end154 reconstruction Gφ∗(yδ) for a given yδ ∈ Y. Specifically, we solve the variational problem155\nmin x∈X ‖A(x)− yδ‖2 + λ′\n( Rθ∗(x) + σ‖x‖22 ) , (8)\nwhere λ′, σ ≥ 0, by applying gradient descent, initialized with Gφ∗(yδ). The additional Tikhonov156 term in (8) ensures coercivity of the overall regularizer, making it amenable to the standard well-157 posedness analysis [24]. Practically, it improves the stability of the gradient descent optimizer158 for (8). In practice, one essentially gets the same reconstruction with σ = 0 subject to early159 stopping (100 iterations). Notably, the fidelity term in (8) is the `2 distance, instead of the squared-`2160 fidelity. We have empirically observed that this choice of the fidelity term improves the quality161 of the reconstruction, possibly due to the higher gradient of the objective in the initial solution162 Gφ∗(yδ). Since the end-to-end reconstruction gives an excellent initial point, it takes significantly163 fewer iterations for gradiet-descent to recover the optimal solution to (8), and therefore UAR retains164 its edge in reconstruction time over fully variational approaches with learned regularizers (e.g., AR165 [14] or its convex version [18]).166\n3 Theoretical results167\nThe theoretical properties of UAR are stated in this section and their proofs are provided in the168 supplementary document. Throughout this section, we assume that X = Rn and Y = Rk, and169\nA1. πx is compactly supported and πyδ is supported on a compact set K ⊂ Rk for every δ ≥ 0.170\nWe then consider the following problem:171\ninf φ sup R∈L1\nJ1 ( Gφ,R|λ, πyδ ) := Eπ\nyδ ∥∥yδ −AGφ(yδ)∥∥22 + λ (Eπyδ [R(Gφ(yδ))]− Eπx [R(x)]) . (9)\nProblem (9) is identical to the min-max variational problem defined in (6), with the only difference172 that the maximization in R is performed over the space of all 1-Lipschitz functions. Basically,173 we consider the theoretical limiting case where the neural networks Rθ are expressive enough to174 approximate all functions in L1 with arbitrary accuracy. We make the following assumptions on Gφ:175\nA2. Gφ is parametrized over a finite dimensional compact set K, i.e. φ ∈ K.176 A3. Gφn → Gφ pointwise whenever φn → φ.177 A4. supφ∈K ‖Gφ‖∞ <∞.178\nAssumptions A2-A4 are satisfied, for instance, when Gφ is parametrized by a neural network whose179 weights are kept bounded during training. These assumptions apply to all results in this section.180\n3.1 Well-posedness of the adversarial loss181\nHere, we prove well-posedness and stability to noise for the optimal reconstructions. As a conse-182 quence of the KR duality, (9) can be equivalently expressed as183\ninf φ J2 ( Gφ|λ, πyδ ) := Eπ yδ ∥∥yδ −AGφ(yδ)∥∥22 + λW1(πx, (Gφ)#πyδ) . (10) In the next theorem, we prove this equivalence, showing the existence of an optimal Gφ andR for (9).184\nTheorem 1. Problems (9) and (10) admit an optimal solution and185 inf φ\nsup R∈L1\nJ1 ( Gφ,R|λ, πyδ ) = inf φ J2 ( Gφ|λ, πyδ ) . (11)\nMoreover, if (Gφ∗ ,R∗) is optimal for (9), then Gφ∗ is optimal for (10). Conversely, if Gφ∗ is optimal for186 (10), then (Gφ∗ ,R∗) is optimal for (9), for allR∗ ∈ arg maxR∈L1 Eπyδ [ R(Gφ∗(yδ)) ] −Eπx [R(x)].187\nNext, we study the stability of the optimal reconstruction Gφ∗ to noise. We consider Gφn , where188 φn ∈ arg inf φ J2 ( Gφ|λ, πyδn ) , (12)\nand show that Gφn → Gφ∗ as δn → δ, thus establishing noise-stability of the unrolled reconstruction.189 Theorem 2 (Stability to noise). Suppose, for given a sequence of noise levels δn → δ ∈ [0,∞), it190 holds that πyδn → πyδ in total variation. Then, with φn as in (12), Gφn → Gφ∗ up to sub-sequences.191\n3.2 Effect of λ on the end-to-end reconstruction192\nIn order to analyze the effect of the parameter λ in (10) on the resulting reconstruction Gφ∗ , it is193 convenient to introduce the following two sets:194\nΦL := { φ : Eπ\nyδ ∥∥yδ −AGφ(yδ)∥∥22 = 0} and ΦW := {φ : (Gφ)#πyδ = πx} . We assume that both ΦL and ΦW are non-empty, which is tantamount to asking that the parametriza-195 tion of the end-to-end reconstruction operator is expressive enough to approximate a right inverse196 of A (ΦL 6= ∅) and a transport map from πyδ to πx (ΦW 6= ∅), and therefore is not very restrictive197 (keeping in view the enormous approximation power of unrolled deep architectures).198 Proposition 1. Let Gφ∗ be a minimizer for (10). Then, it holds that199\n• Eπy ∥∥yδ −AGφ∗(yδ)∥∥22 ≤ λW1(πx, (Gφ)#πyδ), for every φ ∈ ΦL.200\n• W1(πx, (Gφ∗)#πyδ) ≤ 1\nλ Eπ yδ ∥∥yδ −AGφ(yδ)∥∥22 , for every φ ∈ ΦW.201 The previous proposition shows in a quantitative way that for small λ, the optimal Gφ∗ has less202 expected distortion in the measurement space as the quantity Eπ\nyδ ∥∥yδ −AGφ∗(yδ)∥∥22 is small.203 On the other hand, if λ is large, then the optimal Gφ∗ maps πyδ is closer to πx as the quantity204 W(πx, (Gφ∗)#πyδ) is small. Therefore, the regularization is stronger in this case.205 We extend this analysis by studying the behavior of the unrolled reconstruction as λ converges to 0206 and to +∞. Consider a sequence of parameters λn > 0 and the minimizer of the objective in (10)207 with parameter λn:208\nφ′n ∈ arg inf φ\nJ2 ( Gφ|λn, πyδ ) . (13)\nTheorem 3. Suppose that λn → 0 and φ∗1 ∈ arg min φ∈ΦL W1(πx, (Gφ)#πyδ). Then, Gφ′n → Gφ∗1 up to209\nsub-sequences, and lim n→∞ inf φ J2 ( Gφ|λn, πyδ ) = W1(πx, (Gφ∗1 )#πyδ).210\nTheorem 4. Let λn → +∞ and φ∗2 ∈ arg min φ∈ΦW Eπ yδ ∥∥yδ −AGφ(yδ)∥∥22. Then, Gφ′n → Gφ∗2 up to211 sub-sequences, and lim n→∞ inf φ J2 ( Gφ|λn, πyδ ) = Eπ yδ\n∥∥yδ −AGφ∗2 (yδ)∥∥22.212 Theorems 3 and 4 characterize the optimal end-to-end reconstruction Gφ∗ as λ → 0 and λ → ∞,213 respectively. Specifically, if λ→ 0, Gφ∗ minimizes the Wasserstein distance between reconstruction214 and ground-truth among all the reconstruction operators that achieve zero expected data-distortion. In215 particular, Gφ∗ is close to the right inverse of A that minimizes the Wasserstein distance. Therefore,216 when λ is very small, we expect to obtain a reconstruction that is close to the unregularized solution217 in quality. If λ → ∞ on the other hand, the operator Gφ∗ is close to a transport map between218 πx and πyδ , i.e., (Gφ∗)#πyδ = πx, which minimizes the expected data-distortion. Therefore the219 reconstruction produces realistic images, but they are not consistent with the measurement. These220 theoretical observations are corroborated by the numerical results (c.f. Section 4, Fig. 2). One has to221 thus select a λ that optimally trades-off data-distortion with the Wasserstein distance to achieve the222 best reconstruction performance.223\n3.3 End-to-end reconstruction vis-à-vis the variational solution224\nThe goal of this section is two-fold. Firstly, we theoretically justify the fact that the end-to-end recon-225 struction performs well, despite minimizing the expected loss over the distribution πyδ . Secondly, we226 analyze the role of the regularizer in the variational setting in refining the end-to-end reconstruction.227\nIt is important to remark that the the end-to-end reconstruction is trained in on the expected variational228 loss computed using samples from πyδ and πx. Therefore, the end-to-end reconstruction cannot learn229 a point-wise correspondence between measurement and model parameter, but only a distributional230 correspondence. Despite that, the end-to-end reconstruction achieves excellent performance for a231 given measurement vector y. A justification of such phenomena is given by the next proposition.232 Proposition 2. Let (Gφ∗ ,R∗) be an optimal pair for (9) such thatR∗ ≥ 0 almost everywhere under233 (Gφ)# πyδ . Define M1 := Eπyδ\n∥∥yδ −AGφ∗(yδ)∥∥22 and M2 := W1(πx, (Gφ∗)#πyδ). Then, the234 following two upper bounds hold for every η > 0:235\n• Pπ yδ\n{ yδ : ∥∥yδ −AGφ∗(yδ)∥∥22 ≥ η} ≤ M1η .236 • Suppose,R∗(x) = 0 for πx-almost every x. Then, P(Gφ∗ )#πyδ { x : R∗(x) ≥ η } ≤ M2η .237\nProposition 2 provides an estimate in probability of the sets {yδ : ∥∥yδ −AGφ∗(yδ)∥∥22 ≥ η} and238\n{x : R∗(x) ≥ η}. In particular, if M1 is small, then ∥∥yδ −AGφ∗(yδ)∥∥22 is small in probability. If239 instead M2 is small, thenR∗(x) is small in probability on the support of (Gφ∗)#πyδ , implying that240 samples Gφ∗(yδ) are difficult to distinguish from the ground-truth. We remark that the assumption241 R∗(x) = 0 can be justified using a data manifold assumption as in Section 3.3. of [14]. We242 now analyze the role of the regularizer R∗ in the optimization of the variational problem (8) that243 refines the end-to-end reconstruction Gφ∗ . We rely on a similar distributional analysis as the one244 performed in [14]. For η > 0, consider the transformation by a gradient-descent step onR∗ given by245 gη(x) = x− η∇R∗(x). Using the shorthand πG∗ := (Gφ∗)#πyδ , and by denoting the distribution246 of gη(x) as πη := (gη)#πG∗ for x ∼ πG∗ , we have the following theorem.247 Theorem 5 ([14]). Suppose that η →W1(πη, πx) is differentiable at η = 0. Then, the derivative at248 η = 0 satisfies ddηW1(πη, πx) ∣∣∣ η=0 = −EπG∗ ‖∇R∗(x)‖22.249\nThis theorem states that a gradient-descent step performed on R∗ at x = Gφ∗(yδ) decreases the250 Wasserstein distance with respect to the ground-truth distribution πx. Therefore, if the gradient-251 descent step to solve the variational problem (8) is initialized with the reconstruction Gφ∗(yδ), the252 next iterate gets pushed closer to the ground-truth distribution πx. We stress that this property holds253 because of the chosen initialization point, due to the relation between R∗ and Gφ∗ . For a different254 initialization, this property may not hold.255\n4 Numerical results256\nOn the application front, we consider the prototypical inverse problem of CT reconstruction from257 noisy sparse-view projections. The abdominal CT scans for 10 patients, made publicly available by258 the Mayo-Clinic for the low-dose CT grand challenge [15], were used in our numerical experiments.259 Specifically, 2250 2D slices of size 512 × 512 corresponding to 9 patients were used to train the260 models, while 128 slices from the remaining one patient were used for evaluation. The projections261 were simulated in ODL [1] using a parallel-beam geometry with 200 uniformly spaced angular262 positions of the source, with 400 lines per angle. Subsequently, Gaussian noise with standard263 deviation σe = 2.0 was added to the projection data to simulate noisy sinograms.264\nThe proposed UAR method is compared with two classical model-based approaches for CT, namely265 filtered back-projection (FBP) and total variation (TV). The LPD method [3] and U-net-based post-266 processing [10] of FBP are chosen as two supervised approaches for comparison. The AR approach267 [14] and its convex variant [18], referred to as adversarial convex regularizer (ACR) , are taken as the268 competing unsupervised approaches. For LPD and AR, we develop a PyTorch-based implementation269 based on their publicly available TensorFlow codes1 2, while for ACR, we use the publicly available270 PyTorch implementation3.271\nThe unrolled network Gφ has 20 layers, with 5× 5 filters in both primal and dual spaces to increase272 the overall receptive field for sparse-view measurements. The hyper-parameters involved in training273 the UAR are specified in Algorithm 1. We found that first training a baseline regularizer and a274 corresponding baseline reconstruction operator helps stabilize the training process. Training the UAR275 model took approximately 30 hours on an NVIDIA Quadro RTX 6000 GPU (24 GB of memory).276\nThe average performance on the test images in terms of PSNR and SSIM [28] indicates that UAR277 (with λ = 0.1) outperforms AR and ACR by 0.3 dB and 2.6 dB, approximately. We would like278 to emphasize that this gain was found to be consistent across all test images and not just realized279 on average. With the refinement step, UAR surpasses AR by almost 0.7 dB and becomes on par280 with U-net post-processing. The end-to-end UAR reconstruction is a couple of orders of magnitude281 faster than AR, while the reduction in reconstruction time is by a factor of 4 with the refinement.282 The reconstructions of a representative test image using the competing methods are shown in Fig.283 1 for a visual comparison. The effect of λ on the reconstruction of UAR is demonstrated in Fig. 2,284 which confirms the theoretical results in Section 3.2. The refinement step also visibly improves the285 reconstruction quality of the end-to-end operator, as shown in Fig. 3.286\n5 Conclusions and limitations287\nTo the best of our knowledge, this work makes the first attempt to blend end-to-end reconstruction288 with data-driven regularization via an adversarial learning framework. Our UAR approach retains289 the fast reconstruction of the former together with provable guarantees of the latter. We rigorously290 analyze the proposed framework in terms of well-posedness, noise-stability, and the effect of the291 regularization penalty, and establish a link between the trained reconstruction operator and the292 corresponding variational objective. We show strong numerical evidence of the efficacy of the293 UAR approach for CT reconstruction, wherein it achieves the same performance as supervised294 data-driven post-processing and outperforms competing unsupervised techniques. Our work paves295 the way to better understand the role of adversarially learned regularizers in solving ill-posed inverse296 problems, although several important aspects need further investigation. Since the learned regularizer297 is non-convex, the performance of gradient-descent on the variational objective greatly depends on298 initialization. This problem is partly addressed by the unrolled reconstruction operator that efficiently299 computes a better initial point for gradient descent. However, the precise relationship between the300 end-to-end reconstruction and the variational minimizer for a given measurement vector remains301 elusive. Moreover, the quality of the reconstruction relies on the expressive power of neural networks302 and thus suffers from the curse of dimensionality. We believe that addressing such limitations will be303 important to better understand adversarial regularization methods.304\n1LPD: https://github.com/adler-j/learned_primal_dual. 2AR: https://github.com/lunz-s/DeepAdverserialRegulariser. 3ACR: https://github.com/Subhadip-1/data_driven_convex_regularization.\nReferences305 [1] J. Adler, H. Kohr, and O. Öktem. Operator discretization library (odl). Software available from306 https://github.com/odlgroup/odl, 2017.307\n[2] Jonas Adler and Ozan Öktem. Solving ill-posed inverse problems using iterative deep neural308 networks. Inverse Problems, 33(12), 2009.309\n[3] Jonas Adler and Ozan Öktem. Learned primal-dual reconstruction. IEEE transactions on310 medical imaging, 37(6):1322–1332, 2018.311\n[4] Martin Arjovsky, Soumith Chintala, and Léon Bottou. Wasserstein generative adversarial312 networks. In Proceedings of the 34th International Conference on Machine Learning, pages313 214–223, 2017.314\n[5] Simon Arridge, Peter Maass, Ozan Öktem, and Carola-Bibiane Schönlieb. Solving inverse315 problems using data-driven models. Acta Numerica, 28:1–174, 2019.316\n[6] A. Chambolle and T. Pock. A first-order primal-dual algorithm for convex problems with317 applications to imaging. J. Math. Imaging and Vision, 40(1):120–145, 2010.318\n[7] Stanley H Chan, Xiran Wang, and Omar A Elgendy. Plug-and-play admm for image restoration:319 Fixed-point convergence and applications. IEEE Transactions on Computational Imaging, 3(1):320 84–98, 2016.321\n[8] M. Cuturi and G. Peyré. Computational Optimal Transport. Arxiv preprint arXiv:1803.00567,322 2019. https://arxiv.org/pdf/1803.00567.pdf.323\n[9] K. Gregor and Y. LeCun. Learning fast approximations of sparse coding. In Intl. Conf. on324 Machine Learning, 2010.325\n[10] K. H. Jin, M. T. McCann, E. Froustey, and M. Unser. Deep convolutional neural network for326 inverse problems in imaging. IEEE Transactions on Image Processing, 26(9):4509–4522, 2017.327\n[11] Erich Kobler, Teresa Klatzer, Kerstin Hammernik, and Thomas Pock. Variational networks:328 connecting variational methods and deep learning. In German conference on pattern recognition,329 pages 281–293. Springer, 2017.330\n[12] Erich Kobler, Alexander Effland, Karl Kunisch, and Thomas Pock. Total deep variation for331 linear inverse problems. In Proceedings of the IEEE Conference on Computer Vision and332 Pattern Recognition, pages 7549–7558, 2020.333\n[13] Housen Li, Johannes Schwab, Stephan Antholzer, and Markus Haltmeier. NETT: solving334 inverse problems with deep neural networks. Inverse Problems, 36(6), 2020.335\n[14] Sebastian Lunz, Ozan Öktem, and Carola-Bibiane Schönlieb. Adversarial regularizers in inverse336 problems. In Advances in Neural Information Processing Systems, pages 8507–8516, 2018.337\n[15] C. McCollough. Tfg-207a-04: Overview of the low dose ct grand challenge. Medical Physics,338 43(6):3759–3760, 2014.339\n[16] Tim Meinhardt, Michael Moller, Caner Hazirbas, and Daniel Cremers. Learning proximal340 operators: Using denoising networks for regularizing inverse imaging problems. In Proceedings341 of the IEEE International Conference on Computer Vision, pages 1781–1790, 2017.342\n[17] V. Monga, Y. Li, and Y. Eldar. Algorithm unrolling: Interpretable, efficient deep learning for343 signal and image processing. arXiv preprint arXiv:1912.10557v3, 2019.344\n[18] S. Mukherjee, S. Dittmer, Z. Shumaylov, S. Lunz, O. Öktem, and C.-B. Schönlieb. Learned345 convex regularizers for inverse problems. arXiv preprint arXiv:2008.02839v2, 2021.346\n[19] Changheun Oh, Dongchan Kim, Jun-Young Chung, Yeji Han, and H. Park. Eter-net: End to end347 mr image reconstruction using recurrent neural network. In MLMIR@MICCAI, 2018.348\n[20] J.-C. Pesquet, A. Repetti, M. Terris, and Y. Wiaux. Learning maximally monotone operators for349 image recovery. arXiv preprint arXiv:2012.13247v2, Apr. 2021.350\n[21] E. T. Reehorst and P. Schniter. Regularization by denoising: clarifications and new interpreta-351 tions. IEEE Transactions on Computational Imaging, 5(1):52–67, 2019.352\n[22] Yaniv Romano, Michael Elad, and Peyman Milanfar. The little engine that could: Regularization353 by denoising (red). SIAM Journal on Imaging Sciences, 10(4):1804–1844, 2017.354\n[23] F. Santambrogio. Optimal Transport for Applied Mathematicians. Birkhäuser Basel, 2015.355\n[24] Otmar Scherzer, Markus Grasmair, Harald Grossauer, Markus Haltmeier, and Frank Lenzen.356 Variational methods in imaging. Springer, 2009.357\n[25] Y. Sun, B. Wohlberg, and Kamilov U. S. An online plug-and-play algorithm for regularized358 image reconstruction. IEEE Transactions on Computational Imaging, 5(3):395–408, 2019.359\n[26] Dmitry Ulyanov, Andrea Vedaldi, and Victor Lempitsky. Deep image prior. In Proceedings of360 the IEEE Conference on Computer Vision and Pattern Recognition, pages 9446–9454, 2018.361\n[27] C. Villani. Optimal transport — Old and new, volume 338 of Grundlehren der mathematischen362 Wissenschaften. Springer Berlin Heidelberg, 2009. doi: 10.1007/978-3-540-71050-9.363\n[28] Z. Wang, A. C. Bovik, H. R. Sheikh, and E. P. Simoncelli. Image quality assessment: From364 error visibility to structural similarity. IEEE Transactions on Image Processing, 13(4):600–612,365 2004.366\n[29] Y. Yang, J. Sun, H. Li, and Z. Xu. Deep admm-net for compressive sensing mri. In Advances in367 Neural Information Processing Systems, 2016.368\n[30] B. Zhu, J. Z. Liu, S. F. Cauley, B. R. Rosen, and M. S. Rosen. Image reconstruction by369 domain-transform manifold learning. Nature, 555:487–492, 2018.370\nChecklist371\n1. For all authors...372\n(a) Do the main claims made in the abstract and introduction accurately reflect the paper’s373 contributions and scope? [Yes]374\n(b) Did you describe the limitations of your work? [Yes] See Section 5.375 (c) Did you discuss any potential negative societal impacts of your work? [N/A]376 (d) Have you read the ethics review guidelines and ensured that your paper conforms to377 them? [Yes]378\n2. If you are including theoretical results...379\n(a) Did you state the full set of assumptions of all theoretical results? [Yes] Please refer to380 the beginning of Section 3.381\n(b) Did you include complete proofs of all theoretical results? [Yes] Complete proofs are382 included in the supplementary material. In Section 3 of the main paper, we discuss the383 relationship between our results and existing results in the literature.384\n3. If you ran experiments...385\n(a) Did you include the code, data, and instructions needed to reproduce the main ex-386 perimental results (either in the supplemental material or as a URL)? [Yes] Codes387 are included in the supplementary material along with instructions to reproduce the388 experimental results.389\n(b) Did you specify all the training details (e.g., data splits, hyperparameters, how they390 were chosen)? [Yes] Please refer to Section 4 and Algorithm 1.391\n(c) Did you report error bars (e.g., with respect to the random seed after running experi-392 ments multiple times)? [Yes] Please refer to Section 4 and Table 1.393\n(d) Did you include the total amount of compute and the type of resources used (e.g., type394 of GPUs, internal cluster, or cloud provider)? [Yes] See Section 4.395\n4. If you are using existing assets (e.g., code, data, models) or curating/releasing new assets...396\n(a) If your work uses existing assets, did you cite the creators? [Yes] Please refer to Section397 4 for references to the dataset and the codes used in this work.398\n(b) Did you mention the license of the assets? [Yes] The dataset was made public by399 Mayo-Clinic [15].400\n(c) Did you include any new assets either in the supplemental material or as a URL? [Yes]401 Our code is included in the supplemental material.402\n(d) Did you discuss whether and how consent was obtained from people whose data you’re403 using/curating? [Yes] The dataset and the codes used in this work are available publicly.404\n(e) Did you discuss whether the data you are using/curating contains personally identifiable405 information or offensive content? [Yes] In Section 4, we mention that the data used in406 this work are publicly available [15]. For the ease of running our scripts, we convert407 the raw data to numpy format, which does not contain any sensitive information, and408 make them available along with the supplementary material.409\n5. If you used crowdsourcing or conducted research with human subjects...410 (a) Did you include the full text of instructions given to participants and screenshots, if411 applicable? [N/A]412 (b) Did you describe any potential participant risks, with links to Institutional Review413 Board (IRB) approvals, if applicable? [N/A]414 (c) Did you include the estimated hourly wage paid to participants and the total amount415 spent on participant compensation? [N/A]416"
      }
    ],
    "year": 2021,
    "abstractText": "We propose an unsupervised approach for learning end-to-end reconstruction oper1 ators for ill-posed inverse problems. The proposed method combines the classical 2 variational framework with iterative unrolling, which essentially seeks to mini3 mize a weighted combination of the expected distortion in the measurement space 4 and the Wasserstein-1 distance between the distributions of the reconstruction 5 and ground-truth. More specifically, the regularizer in the variational setting is 6 parametrized by a deep neural network and learned simultaneously with the un7 rolled reconstruction operator. The variational problem is then initialized with 8 the reconstruction of the unrolled operator and solved iteratively till convergence. 9 Notably, it takes significantly fewer iterations to converge, thanks to the excellent 10 initialization obtained via the unrolled operator. The resulting approach combines 11 the computational efficiency of end-to-end unrolled reconstruction with the well12 posedness and noise-stability guarantees of the variational setting. Moreover, we 13 demonstrate with the example of X-ray computed tomography (CT) that our ap14 proach outperforms state-of-the-art unsupervised methods, and that it outperforms 15 or is on par with state-of-the-art supervised learned reconstruction approaches. 16",
    "creator": "LaTeX with hyperref"
  },
  "output": [
    [
      "1. \"First there are two well written past works that overlap too much with this paper. One that has been referenced here (see ref 12) by Erich Kobler et. al. at CVPR 2020 where they cover the variational approach in detail and it's application to CT.\"",
      "2. \"The second is the paper Sim, Byeongsu, et al. 'Optimal transport driven CycleGAN for unsupervised learning in inverse problems.' SIAM Journal on Imaging Sciences 13.4 (2020): 2281-2306. The above besides addressing optimal transport approaches for inverse problems, also addresses the adversarial training aspect and further looks at various applications, including CT.\"",
      "3. \"Second, only CT image reconstruction is demonstrated. probably it works with other modalities as well, but it hasn't been demonstrated in the main body of the paper.\""
    ],
    [
      "1. \"Supervised vs. unsupervised: While it is true that pairs of (image, measurement) data are not strictly required, the method does require ground-truth reference images for training. Therefore I believe it is misleading to consider this unsupervised.\"",
      "2. \"End-to-end vs variational reconstruction: The authors claim that a big benefit of their approach is the ability to use the end-to-end reconstruction as an initialization in a variational framework, where the regularizer previously learned can be used. While this is interesting, there are some comparative details missing. For example, how would this compare if I used some other end-to-end reconstruction (for example, the one in Ref [3]) with a regularizer that was separately trained in an adversarial fashion (for example, the one in Ref [14]). To what extent is it critical that they be coupled?\"",
      "3. \"In addition, based on Table 1, the number of iterations is reduced by a factor of about 4, while still slower than end-to-end alone by a factor of over 20. Therefore, it feels misleading to say that 'the refinement step involves running a few iterations'. How would the variational reconstruction perform (speed and quality) if initialized with a different point, e.g., the pseudo-inverse, or a different end-to-end reconstruction such as the simple U-Net?\"",
      "4. \"Experiments. The experiments are limited to a single dataset consisting of 9 patients used for training, one patient used for testing (it is unclear if Supporting Fig 2 is a different patient or a different slice of the same patient), and no explanation of validation data (was the test set actively used for validation?). To me this is very limiting in terms of empirical evidence. Since the paper title is quite general, it would be interesting to see performance for other inverse problems.\"",
      "5. \"I also would like to authors to clarify why they added Gaussian noise to the measurements. Based on the webpage for the low-dose CT challenge, I understand that the challenge organizers added Poisson noise to the projection data.\""
    ],
    [
      "1. \"the experiment seems inadequate with only one experiment on CT.\"",
      "2. \"the justification for the usage of unfolding networks as the 'generator' is somewhat missing.\""
    ],
    [
      "1. \"In its current form, UAR seems to share a lot of similarities with Wasserstein GANs, and thus parallels can be drawn with other works which have used similar techniques for image reconstruction. For example, there is some work on using a similar technique to UAR on MR images (Lei et al., 2020). Even though I think comparison with such works should be included, I think the originality of this paper is not significantly hampered, since the authors also include theoretical statements and proofs on the properties of UAR.\"",
      "2. \"I find it particularly interesting that that UAR is 2 orders of magnitude faster than AR, even though intuitively it would make sense to me that AR should converge faster (since the regularizer and the reconstruction are trained separately). I believe that this result merits further discussion in the experimental section.\"",
      "3. \"In Algorithm 1, it seems that the batch size is set as equal to 1. I am not sure if this is correct or a typo, because it seems quite a weird choice to make for batch size.\"",
      "4. \"Again in Algorithm 1, the way for loops are written implies looping over both mini-batches and epochs. I think it would be clearer if the epochs were written separately.\"",
      "5. \"Section 2.2.2 is used to define the reconstruction network Gϕ, but I think the way it is placed breaks the flow of the paper a little, because Section 2.2.3 refers to a refinement step, which I believe would be better to mention directly after the original training process in Section 2.2.1. I would suggest either moving Section 2.2.2, or including its contents in the previous one.\"",
      "6. \"There is a small typo in line 143, for the definition of the reconstruction network.\"",
      "7. \"Overall, I believe this is a good and interesting submission. I have some slight reservations about the originality of the method proposed, but I think these are overcome by the theoretical analysis provided.\""
    ],
    [
      "1. \"the methodical contributions are limited.\"",
      "2. \"I found it hard to follow at some specific sections due to the insufficient details on the notations.\"",
      "3. \"the definition and meaning of δ in πyδ that is first presented in line 118 is not clearly stated.\"",
      "4. \"it would be better to introduce the 1-lipschitz constrained loss in Algorithm 1 with more details.\"",
      "5. \"some typos exist such as missing k for ϕk in Eq. 4.\""
    ]
  ],
  "review_num": 5,
  "item_num": [
    3,
    5,
    2,
    7,
    5
  ]
}